// Auto-saved by Denchai GIS Editor — 1/9/2569 16:04:18
export const INFRA_CATEGORIES = {
  "highway": {
    "name_th": "ทางหลวงแผ่นดิน (ทล.11/101)",
    "name_en": "National Highways",
    "color": "#ea580c",
    "icon": "🛣️"
  },
  "rural_road": {
    "name_th": "ทางหลวงชนบท (ทช.)",
    "name_en": "Rural Roads",
    "color": "#0284c7",
    "icon": "🚗"
  },
  "main_road": {
    "name_th": "ถนนสายหลักเทศบาล (สายประธาน)",
    "name_en": "Primary Municipal Arterials",
    "color": "#f59e0b",
    "icon": "🏙️"
  },
  "collector_road": {
    "name_th": "ถนนสายรอง/เชื่อมชุมชน",
    "name_en": "Secondary / Collector Roads",
    "color": "#fb923c",
    "icon": "🏘️"
  },
  "local_road": {
    "name_th": "ถนนซอย/บริการชุมชน",
    "name_en": "Local & Access Sois",
    "color": "#64748b",
    "icon": "🏡"
  },
  "agri_road": {
    "name_th": "ถนนเพื่อการเกษตร/คันคลอง",
    "name_en": "Agricultural & Canal Roads",
    "color": "#10b981",
    "icon": "🌾"
  },
  "planned_road": {
    "name_th": "ถนนโครงการตามแผนพัฒนา/ผังเมือง",
    "name_en": "Planned / Development Projects",
    "color": "#ec4899",
    "icon": "🚧"
  },
  "rail": {
    "name_th": "ทางรถไฟสายเหนือ",
    "name_en": "Northern Railway Line",
    "color": "#581c87",
    "icon": "🚆"
  },
  "bridge": {
    "name_th": "สะพาน",
    "name_en": "Bridges",
    "color": "#dc2626",
    "icon": "🌉"
  },
  "water": {
    "name_th": "ระบบประปา/แหล่งน้ำ",
    "name_en": "Water Supply",
    "color": "#06b6d4",
    "icon": "💧"
  },
  "electric": {
    "name_th": "ระบบไฟฟ้า/สถานีย่อย",
    "name_en": "Electrical Substation",
    "color": "#facc15",
    "icon": "⚡"
  }
};
export const INFRA_DATA = {
  "type": "FeatureCollection",
  "features": [
    {
      "type": "Feature",
      "id": "merged_994653",
      "properties": {
        "id": "merged_994653",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": 2,
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 1.794
      },
      "geometry": {
        "coordinates": [
          [
            100.04984034906145,
            17.967724241386442
          ],
          [
            100.05177999876284,
            17.966280900537484
          ],
          [
            100.0519988786626,
            17.966118996624427
          ],
          [
            100.0522330392078,
            17.965996156786595
          ],
          [
            100.05245933856108,
            17.965913596987257
          ],
          [
            100.0525657419182,
            17.96588034112602
          ],
          [
            100.05265401916546,
            17.965861292458662
          ],
          [
            100.05275807945854,
            17.965842971749836
          ],
          [
            100.05287279901005,
            17.965828701346265
          ],
          [
            100.0530027422158,
            17.965817655248653
          ],
          [
            100.05312841980033,
            17.965818769034588
          ],
          [
            100.05325929992446,
            17.965829700241112
          ],
          [
            100.05337953727386,
            17.96584949875608
          ],
          [
            100.0560339852917,
            17.966384377449998
          ],
          [
            100.05815482869748,
            17.966827423163657
          ],
          [
            100.05901030472506,
            17.967021544847224
          ],
          [
            100.05952869678438,
            17.967179527415926
          ],
          [
            100.06093105611804,
            17.96764452646037
          ],
          [
            100.06375472557274,
            17.968621289926258
          ],
          [
            100.06446060860112,
            17.968856987516354
          ],
          [
            100.06562093077454,
            17.969257177789114
          ]
        ],
        "type": "LineString"
      }
    },
    {
      "type": "Feature",
      "id": "merged_957581",
      "properties": {
        "id": "merged_957581",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": 2,
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 2.622
      },
      "geometry": {
        "coordinates": [
          [
            100.06563474062048,
            17.96914629969267
          ],
          [
            100.06494675179684,
            17.968904218269554
          ],
          [
            100.06381399942686,
            17.968514411436395
          ],
          [
            100.06192465751298,
            17.96786238955351
          ],
          [
            100.06004608748023,
            17.967200175588257
          ],
          [
            100.05937972644394,
            17.967005912119664
          ],
          [
            100.05905847342777,
            17.966924609067018
          ],
          [
            100.0581878,
            17.966721582895676
          ],
          [
            100.05774637290995,
            17.96661651471478
          ],
          [
            100.05632951837217,
            17.966325198041726
          ],
          [
            100.05461472507788,
            17.96599688495185
          ],
          [
            100.05360005734951,
            17.965784184342983
          ],
          [
            100.0533228209381,
            17.965732330840762
          ],
          [
            100.05317142615444,
            17.9657229036098
          ],
          [
            100.05300425203424,
            17.96572270149681
          ],
          [
            100.05286223108604,
            17.96573622394079
          ],
          [
            100.05270247494838,
            17.96575677903906
          ],
          [
            100.05248821738203,
            17.965809900790923
          ],
          [
            100.05233086241645,
            17.96586144562936
          ],
          [
            100.05217717317078,
            17.965924273687158
          ],
          [
            100.0519356960708,
            17.966055352072594
          ],
          [
            100.05173971216527,
            17.96619407605065
          ],
          [
            100.04933917064913,
            17.967951634525676
          ],
          [
            100.04787577954579,
            17.9690246650434
          ],
          [
            100.04507179007733,
            17.971124127776747
          ],
          [
            100.04422527278611,
            17.971710298346398
          ],
          [
            100.04389085897942,
            17.971929368577253
          ],
          [
            100.0436082884691,
            17.97209865511421
          ]
        ],
        "type": "LineString"
      }
    },
    {
      "type": "Feature",
      "id": "road-108541501_part2_0893",
      "properties": {
        "id": "road-108541501_part2_0893",
        "name_th": "ทางหลวงหมายเลข พร.6019 (ตอน 2)",
        "name_en": "พร.6019 (Part 2)",
        "ref": "พร.6019",
        "category": "main_road",
        "highway_type": "tertiary",
        "surface": "asphalt",
        "lanes": 2,
        "length_km": 2.529
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.04545934271121,
            18.00569639482268
          ],
          [
            100.045277,
            18.005396
          ],
          [
            100.045182,
            18.005254
          ],
          [
            100.044668,
            18.004529
          ],
          [
            100.044567,
            18.004371
          ],
          [
            100.044446,
            18.004175
          ],
          [
            100.044223,
            18.003754
          ],
          [
            100.044129,
            18.003538
          ],
          [
            100.04407,
            18.003375
          ],
          [
            100.044041,
            18.003236
          ],
          [
            100.04396,
            18.002543
          ],
          [
            100.043874,
            18.001941
          ],
          [
            100.043813,
            18.001414
          ],
          [
            100.043755,
            18.000773
          ],
          [
            100.043736,
            18.000504
          ],
          [
            100.043724,
            18.000167
          ],
          [
            100.043723,
            18.000072
          ],
          [
            100.043743,
            17.999966
          ],
          [
            100.043802,
            17.999876
          ],
          [
            100.044088,
            17.999603
          ],
          [
            100.044422,
            17.99928
          ],
          [
            100.044602,
            17.999113
          ],
          [
            100.044735,
            17.998957
          ],
          [
            100.047052,
            17.995925
          ],
          [
            100.049827,
            17.992338
          ],
          [
            100.051527,
            17.990226
          ],
          [
            100.052141,
            17.989446
          ],
          [
            100.052384,
            17.989123
          ],
          [
            100.052818,
            17.988547
          ],
          [
            100.053366,
            17.987922
          ],
          [
            100.053506,
            17.987718
          ],
          [
            100.053657,
            17.987464
          ],
          [
            100.053802,
            17.987209
          ],
          [
            100.053914,
            17.986984
          ],
          [
            100.053981,
            17.986766
          ],
          [
            100.054022,
            17.986574
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "id": "road-84273686_part1_8955_part1_4987_part1_8899_part2_5333",
      "properties": {
        "id": "road-84273686_part1_8955_part1_4987_part1_8899_part2_5333",
        "name_th": "ทางรถไฟสายเหนือ (ตอน 1) (ตอน 1) (ตอน 1) (ตอน 2)",
        "name_en": "Northern Railway (Part 1) (Part 1) (Part 1) (Part 2)",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2,
        "length_km": 4.913
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.02432017967195,
            17.988147093758002
          ],
          [
            100.030683,
            17.985931
          ],
          [
            100.033574,
            17.984933
          ],
          [
            100.034562,
            17.984589
          ],
          [
            100.034966,
            17.984468
          ],
          [
            100.036995,
            17.983744
          ],
          [
            100.039024,
            17.98304
          ],
          [
            100.043164,
            17.981613
          ],
          [
            100.044951,
            17.980954
          ],
          [
            100.046218,
            17.980525
          ],
          [
            100.047093,
            17.980215
          ],
          [
            100.048365,
            17.979779
          ],
          [
            100.049018,
            17.979547
          ],
          [
            100.049126,
            17.979521
          ],
          [
            100.049463,
            17.979386
          ],
          [
            100.049637,
            17.979265
          ],
          [
            100.049682,
            17.979233
          ],
          [
            100.04985,
            17.979092
          ],
          [
            100.049904,
            17.979032
          ],
          [
            100.050034,
            17.978886
          ],
          [
            100.050194,
            17.978657
          ],
          [
            100.050292,
            17.978403
          ],
          [
            100.050842,
            17.976003
          ],
          [
            100.051334,
            17.974247
          ],
          [
            100.051433,
            17.973928
          ],
          [
            100.051562,
            17.973606
          ],
          [
            100.051694,
            17.973339
          ],
          [
            100.051843,
            17.973098
          ],
          [
            100.051997,
            17.972859
          ],
          [
            100.052192,
            17.972612
          ],
          [
            100.056102,
            17.968533
          ],
          [
            100.056281,
            17.968325
          ],
          [
            100.056402,
            17.968175
          ],
          [
            100.056516,
            17.967972
          ],
          [
            100.056623,
            17.967732
          ],
          [
            100.056709,
            17.967478
          ],
          [
            100.056775,
            17.967231
          ],
          [
            100.056828,
            17.96691
          ],
          [
            100.05687,
            17.966528
          ],
          [
            100.056946,
            17.966069
          ],
          [
            100.057021,
            17.965614
          ],
          [
            100.0575739095825,
            17.962979102142622
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "id": "road-84273686_part1_8955_part1_4987_part2_8899",
      "properties": {
        "id": "road-84273686_part1_8955_part1_4987_part2_8899",
        "name_th": "ทางรถไฟสายเหนือ (ตอน 1) (ตอน 1) (ตอน 2)",
        "name_en": "Northern Railway (Part 1) (Part 1) (Part 2)",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2,
        "length_km": 0.012
      },
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.0575739095825,
            17.962979102142622
          ],
          [
            100.05759538760601,
            17.96287674671497
          ]
        ]
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.0656223984749,
            17.969258130070525
          ],
          [
            100.06692423951097,
            17.969707059072555
          ],
          [
            100.06728657155593,
            17.969834797807064
          ],
          [
            100.06827705448173,
            17.970168987083408
          ],
          [
            100.06897700217873,
            17.970416257991126
          ],
          [
            100.0705396705572,
            17.97095178005674
          ],
          [
            100.07471096320404,
            17.9723965481479
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-108303100",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "101",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": "2",
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 1.023
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.07365098942255,
            17.971911668797407
          ],
          [
            100.0711878382902,
            17.97105017941726
          ],
          [
            100.07004851137387,
            17.970658871976028
          ],
          [
            100.06801864082597,
            17.96994782778644
          ],
          [
            100.06710344674659,
            17.969622350811836
          ],
          [
            100.06650995267569,
            17.96943491227824
          ],
          [
            100.06621197768432,
            17.969341349044342
          ],
          [
            100.06563935989966,
            17.969148017614355
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-311270379",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "101",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": "2",
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 0.901
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.06562069439754,
            17.96925654673242
          ],
          [
            100.06571533651847,
            17.96871506581294
          ],
          [
            100.06590900772228,
            17.96768341800654
          ],
          [
            100.06615897306179,
            17.966340398292527
          ],
          [
            100.06616916329062,
            17.966282933351785
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-454883792",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "paved",
        "lanes": 2,
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 0.336
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.06605890418456,
            17.966265347141213
          ],
          [
            100.06601652879125,
            17.96649276563249
          ],
          [
            100.065886,
            17.967149
          ],
          [
            100.06560558288598,
            17.968697951070386
          ],
          [
            100.06550736445396,
            17.969217216196288
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-667857897",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "paved",
        "lanes": 2,
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 0.333
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.08265065337476,
            17.974982175037034
          ],
          [
            100.07669628828123,
            17.97296175694791
          ],
          [
            100.07587418906135,
            17.972666846725783
          ],
          [
            100.07484450871846,
            17.97232257927053
          ],
          [
            100.0743174640095,
            17.97214353100734
          ],
          [
            100.07383942483794,
            17.9719782511535
          ],
          [
            100.07365200033506,
            17.97191265871225
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1075535857",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "101",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": "2",
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 1.011
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.07471059648704,
            17.972397552439144
          ],
          [
            100.07540724261979,
            17.972641818983394
          ],
          [
            100.07667226750279,
            17.973068281357822
          ],
          [
            100.07704458316336,
            17.973187945772366
          ],
          [
            100.08253221332596,
            17.975117464732158
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1075535858",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "101",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": "2",
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 0.881
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.04172521817263,
            17.973748615763768
          ],
          [
            100.0412525999449,
            17.97409635093688
          ],
          [
            100.04003600319446,
            17.97501360009762
          ],
          [
            100.03813074924948,
            17.97643370355626
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1233926549",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": 2,
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 0.483
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.03139857533051,
            17.977925700190852
          ],
          [
            100.03323153116494,
            17.977741314095084
          ],
          [
            100.03542094161544,
            17.97753463073839
          ],
          [
            100.03646756109644,
            17.977421838221066
          ],
          [
            100.03682195087093,
            17.977343355669277
          ],
          [
            100.03708571248643,
            17.977249878417325
          ],
          [
            100.03734525942596,
            17.977144359279265
          ],
          [
            100.03767035116645,
            17.97695150905172
          ],
          [
            100.03849798560698,
            17.976348937646478
          ],
          [
            100.04011975308022,
            17.975134916680794
          ],
          [
            100.04138817466074,
            17.974187488243867
          ],
          [
            100.04222678941258,
            17.973560944516596
          ],
          [
            100.04310206906648,
            17.972927552503105
          ],
          [
            100.04359254310992,
            17.97258914225611
          ],
          [
            100.0436947964475,
            17.972514723571127
          ],
          [
            100.04377058323817,
            17.972455516012413
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1233926556",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": 2,
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 1.494
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.03813088008891,
            17.97643563783474
          ],
          [
            100.037801567774,
            17.976672609465986
          ],
          [
            100.03756170505001,
            17.97684295083093
          ],
          [
            100.0373372031831,
            17.976973601718708
          ],
          [
            100.03722403116286,
            17.97702921206554
          ],
          [
            100.03704746556743,
            17.977105035084602
          ],
          [
            100.03690332332519,
            17.977158174431082
          ],
          [
            100.03675195532949,
            17.97720517445304
          ],
          [
            100.03656602599628,
            17.97725213329951
          ],
          [
            100.03633956865716,
            17.97729405096711
          ],
          [
            100.03465256760484,
            17.977474727336247
          ],
          [
            100.03318510728815,
            17.977613700120674
          ],
          [
            100.03142500025092,
            17.97777281684691
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1233926569",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": "2",
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 0.738
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.04360543771838,
            17.97210091783319
          ],
          [
            100.04324128892603,
            17.97240221276429
          ],
          [
            100.04289942794031,
            17.972718917732696
          ],
          [
            100.04225065491526,
            17.973293523727857
          ],
          [
            100.04172687947646,
            17.973741989606992
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1235733019",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": 2,
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 0.27
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.04377232285324,
            17.972453673361397
          ],
          [
            100.04404036897327,
            17.972222705227498
          ],
          [
            100.04476808960855,
            17.971617911010988
          ],
          [
            100.04560094439022,
            17.97096149439793
          ],
          [
            100.0464342968678,
            17.97032266641051
          ],
          [
            100.0471003781194,
            17.9698286147849
          ],
          [
            100.04794826478015,
            17.96920315398904
          ],
          [
            100.04854584636128,
            17.96876276924436
          ],
          [
            100.04911547887212,
            17.96833840424084
          ],
          [
            100.04983617967808,
            17.967730755163338
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1235733021",
        "name_th": "ทางหลวงแผ่นดินหมายเลข 11 (ทล.11)",
        "name_en": "Highway 11 (Super Highway)",
        "ref": "11",
        "category": "highway",
        "highway_type": "trunk",
        "surface": "asphalt",
        "lanes": 2,
        "description_th": "ทางหลวงสายหลักเชื่อม เด่นชัย - พิษณุโลก - ลำปาง",
        "length_km": 0.829
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.03324758692622,
            17.97762091377233
          ],
          [
            100.033279957597,
            17.97786348974457
          ],
          [
            100.03329443250965,
            17.97800808200846
          ],
          [
            100.03331848657282,
            17.97809101229626
          ],
          [
            100.0333549113082,
            17.978136522538275
          ],
          [
            100.03339101943587,
            17.978174497951468
          ],
          [
            100.03344459858776,
            17.97820942831784
          ],
          [
            100.03350486113219,
            17.978237877140625
          ],
          [
            100.03357806961193,
            17.97825584030033
          ],
          [
            100.03369338233226,
            17.978269799385366
          ],
          [
            100.033942112015,
            17.978297272796052
          ],
          [
            100.03428588798495,
            17.978334766701554
          ],
          [
            100.03460517286867,
            17.97836974880456
          ],
          [
            100.03494571645257,
            17.97840458922745
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-84273632",
        "name_th": "ทางหลวงหมายเลข 1419",
        "name_en": "1419",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2,
        "length_km": 0.233
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.049846,
            17.98108
          ],
          [
            100.050387,
            17.981454
          ]
        ]
      },
      "properties": {
        "id": "road-108309282",
        "name_th": "ถนนยันตรกิจโกศล",
        "name_en": "Yantarakit Koson Road",
        "ref": "1379",
        "category": "main_road",
        "highway_type": "tertiary",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.050387,
            17.981454
          ],
          [
            100.050763,
            17.981752
          ]
        ]
      },
      "properties": {
        "id": "road-108309283",
        "name_th": "ถนนยันตรกิจโกศล",
        "name_en": "Yantarakit Koson Road",
        "ref": "1379",
        "category": "main_road",
        "highway_type": "tertiary",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.050763,
            17.981752
          ],
          [
            100.05162,
            17.982446
          ],
          [
            100.051693,
            17.982506
          ],
          [
            100.052033,
            17.982781
          ],
          [
            100.052092,
            17.982831
          ],
          [
            100.052394,
            17.983075
          ],
          [
            100.052727,
            17.983341
          ]
        ]
      },
      "properties": {
        "id": "road-108309284",
        "name_th": "ถนนยันตรกิจโกศล",
        "name_en": "Yantarakit Koson Road",
        "ref": "1379",
        "category": "main_road",
        "highway_type": "tertiary",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.052727,
            17.983341
          ],
          [
            100.053368,
            17.983841
          ],
          [
            100.053611,
            17.983991
          ],
          [
            100.053717,
            17.98405
          ],
          [
            100.053824,
            17.984104
          ],
          [
            100.053984,
            17.984183
          ],
          [
            100.054234,
            17.984282
          ],
          [
            100.054339,
            17.984323
          ],
          [
            100.054445,
            17.984358
          ],
          [
            100.054684,
            17.984425
          ],
          [
            100.054889,
            17.984473
          ],
          [
            100.055079,
            17.984507
          ],
          [
            100.055317,
            17.984528
          ],
          [
            100.055533,
            17.984536
          ],
          [
            100.055832,
            17.984549
          ],
          [
            100.056094,
            17.984524
          ],
          [
            100.056341,
            17.984487
          ],
          [
            100.056661,
            17.984425
          ],
          [
            100.05687,
            17.984369
          ],
          [
            100.057068,
            17.984289
          ],
          [
            100.057194,
            17.984201
          ],
          [
            100.057908,
            17.983892
          ],
          [
            100.058384,
            17.983628
          ],
          [
            100.058752,
            17.98342
          ]
        ]
      },
      "properties": {
        "id": "road-108749890",
        "name_th": "ถนนยันตรกิจโกศล",
        "name_en": "Yantarakit Koson Road",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.054093,
            17.980926
          ],
          [
            100.053963,
            17.981342
          ]
        ]
      },
      "properties": {
        "id": "road-108749946",
        "name_th": "ทางหลวงหมายเลข 1419",
        "name_en": "1419",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.076644,
            17.973146
          ],
          [
            100.076458,
            17.973569
          ],
          [
            100.076255,
            17.974069
          ],
          [
            100.076172,
            17.974198
          ],
          [
            100.076082,
            17.97431
          ],
          [
            100.075953,
            17.974424
          ],
          [
            100.075836,
            17.974503
          ],
          [
            100.073278,
            17.975823
          ],
          [
            100.071111,
            17.97693
          ],
          [
            100.069139,
            17.977942
          ],
          [
            100.0642,
            17.980515
          ],
          [
            100.061808,
            17.981758
          ],
          [
            100.059595,
            17.982912
          ],
          [
            100.058951,
            17.983267
          ],
          [
            100.058752,
            17.98342
          ]
        ]
      },
      "properties": {
        "id": "road-112980650",
        "name_th": "ถนนยันตรกิจโกศล",
        "name_en": "Yantarakit Koson Road",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.058752,
            17.98342
          ],
          [
            100.059001,
            17.983326
          ],
          [
            100.059078,
            17.983286
          ],
          [
            100.059562,
            17.983044
          ],
          [
            100.060354,
            17.982624
          ],
          [
            100.06183,
            17.981869
          ],
          [
            100.06358,
            17.980955
          ],
          [
            100.065576,
            17.979915
          ],
          [
            100.066611,
            17.979381
          ],
          [
            100.067176,
            17.979092
          ],
          [
            100.067844,
            17.97875
          ],
          [
            100.068246,
            17.978538
          ],
          [
            100.069173,
            17.978056
          ],
          [
            100.071095,
            17.977052
          ],
          [
            100.073331,
            17.975912
          ],
          [
            100.073546,
            17.975803
          ],
          [
            100.07589,
            17.974604
          ],
          [
            100.076053,
            17.974504
          ],
          [
            100.076166,
            17.974411
          ],
          [
            100.076217,
            17.974347
          ],
          [
            100.076265,
            17.974287
          ],
          [
            100.076325,
            17.974181
          ],
          [
            100.076403,
            17.974032
          ],
          [
            100.076598,
            17.973522
          ],
          [
            100.076748,
            17.973183
          ]
        ]
      },
      "properties": {
        "id": "road-112980771",
        "name_th": "ถนนยันตรกิจโกศล",
        "name_en": "Yantarakit Koson Road",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.068246,
            17.978538
          ],
          [
            100.068577,
            17.97897
          ],
          [
            100.068872,
            17.979352
          ],
          [
            100.069127,
            17.979675
          ],
          [
            100.069457,
            17.9801
          ],
          [
            100.069858,
            17.980595
          ],
          [
            100.070213,
            17.981046
          ],
          [
            100.070386,
            17.981278
          ],
          [
            100.07057,
            17.981502
          ],
          [
            100.070877,
            17.981912
          ],
          [
            100.071203,
            17.982314
          ],
          [
            100.071232,
            17.982332
          ],
          [
            100.071259,
            17.982333
          ],
          [
            100.071278,
            17.982325
          ],
          [
            100.071614,
            17.982062
          ],
          [
            100.072301,
            17.981585
          ],
          [
            100.07232,
            17.981532
          ],
          [
            100.071978,
            17.981048
          ]
        ]
      },
      "properties": {
        "id": "road-449472409",
        "name_th": "ซอยยันตรกิจโกศล 17",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "main_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.069856,
            17.981598
          ],
          [
            100.069422,
            17.981035
          ],
          [
            100.069357,
            17.980951
          ],
          [
            100.069017,
            17.980453
          ],
          [
            100.067844,
            17.97875
          ]
        ]
      },
      "properties": {
        "id": "road-449472414",
        "name_th": "ซอยยันตรกิจโกศล 16",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "main_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.053963,
            17.981342
          ],
          [
            100.053727,
            17.982071
          ],
          [
            100.053643,
            17.982246
          ],
          [
            100.053533,
            17.982441
          ],
          [
            100.053442,
            17.982571
          ],
          [
            100.053331,
            17.982712
          ],
          [
            100.053159,
            17.982915
          ],
          [
            100.052727,
            17.983341
          ]
        ]
      },
      "properties": {
        "id": "road-1075535859",
        "name_th": "ทางหลวงหมายเลข 1419",
        "name_en": "1419",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.048687,
            17.980905
          ],
          [
            100.049165,
            17.980972
          ],
          [
            100.049611,
            17.981036
          ],
          [
            100.049846,
            17.98108
          ]
        ]
      },
      "properties": {
        "id": "road-1084617153",
        "name_th": "ถนนยันตรกิจโกศล",
        "name_en": "Yantarakit Koson Road",
        "ref": "1379",
        "category": "main_road",
        "highway_type": "tertiary",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.054022,
            17.986574
          ],
          [
            100.054074,
            17.98637
          ],
          [
            100.054123,
            17.986218
          ],
          [
            100.054221,
            17.985853
          ],
          [
            100.054357,
            17.985246
          ],
          [
            100.054422,
            17.984895
          ],
          [
            100.054424,
            17.984728
          ],
          [
            100.054445,
            17.984358
          ]
        ]
      },
      "properties": {
        "id": "road-1138587832",
        "name_th": "ถนนยันตรกิจโกศล ซอย 9",
        "name_en": "Yantarakit Kosol Rd Soi 9",
        "ref": "พร.6019",
        "category": "main_road",
        "highway_type": "tertiary",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.082225,
            17.984109
          ],
          [
            100.082039,
            17.983962
          ],
          [
            100.079103,
            17.981758
          ],
          [
            100.077843,
            17.980807
          ],
          [
            100.07582,
            17.979282
          ],
          [
            100.075615,
            17.97917
          ],
          [
            100.075367,
            17.978952
          ],
          [
            100.075219,
            17.978804
          ],
          [
            100.075039,
            17.978594
          ],
          [
            100.074878,
            17.978364
          ],
          [
            100.074566,
            17.977901
          ],
          [
            100.073331,
            17.975912
          ],
          [
            100.073278,
            17.975823
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1227118063",
        "name_th": "ทางหลวงหมายเลข พร.3024",
        "name_en": "พร.3024",
        "ref": "พร.3024",
        "category": "main_road",
        "highway_type": "tertiary",
        "surface": "asphalt",
        "lanes": 2,
        "length_km": 1.338
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.040899,
            17.979084
          ],
          [
            100.041469,
            17.979139
          ],
          [
            100.041645,
            17.979163
          ],
          [
            100.041864,
            17.979187
          ],
          [
            100.042113,
            17.979222
          ],
          [
            100.042277,
            17.979234
          ],
          [
            100.042452,
            17.979243
          ],
          [
            100.042649,
            17.979235
          ],
          [
            100.042921,
            17.979207
          ],
          [
            100.043281,
            17.979144
          ],
          [
            100.043498,
            17.979085
          ],
          [
            100.043766,
            17.978995
          ],
          [
            100.04411,
            17.978847
          ],
          [
            100.044535,
            17.97867
          ],
          [
            100.046282,
            17.977965
          ],
          [
            100.047351,
            17.977543
          ],
          [
            100.047541,
            17.977467
          ],
          [
            100.047716,
            17.977359
          ],
          [
            100.047837,
            17.977241
          ],
          [
            100.047948,
            17.977083
          ],
          [
            100.048085,
            17.976844
          ],
          [
            100.048334,
            17.976338
          ],
          [
            100.048503,
            17.976106
          ],
          [
            100.048704,
            17.975968
          ],
          [
            100.048963,
            17.975857
          ],
          [
            100.049223,
            17.975775
          ],
          [
            100.049462,
            17.975742
          ],
          [
            100.049682,
            17.975746
          ],
          [
            100.0499,
            17.975777
          ],
          [
            100.050842,
            17.976003
          ],
          [
            100.051159,
            17.976083
          ],
          [
            100.051855,
            17.976261
          ],
          [
            100.052109,
            17.976367
          ],
          [
            100.052382,
            17.976511
          ],
          [
            100.052564,
            17.97664
          ],
          [
            100.052816,
            17.976818
          ],
          [
            100.053039,
            17.977026
          ],
          [
            100.053568,
            17.977535
          ],
          [
            100.053832,
            17.977823
          ],
          [
            100.05402,
            17.978081
          ],
          [
            100.054138,
            17.978299
          ],
          [
            100.054232,
            17.978547
          ],
          [
            100.05432,
            17.978769
          ],
          [
            100.054386,
            17.978998
          ],
          [
            100.05442,
            17.979229
          ],
          [
            100.054443,
            17.979502
          ],
          [
            100.054418,
            17.97978
          ],
          [
            100.054357,
            17.980037
          ],
          [
            100.054286,
            17.980244
          ],
          [
            100.054093,
            17.980926
          ]
        ]
      },
      "properties": {
        "id": "road-1233926552",
        "name_th": "ทางหลวงหมายเลข 1419",
        "name_en": "1419",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.040608,
            17.979056
          ],
          [
            100.040899,
            17.979084
          ]
        ]
      },
      "properties": {
        "id": "road-1233926559",
        "name_th": "ทางหลวงหมายเลข 1419",
        "name_en": "1419",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.03495342046847,
            17.97840471017724
          ],
          [
            100.03593813527802,
            17.978496183317425
          ],
          [
            100.03814413690897,
            17.978707266452492
          ],
          [
            100.03910169335819,
            17.978816069925486
          ],
          [
            100.03951531024893,
            17.978853294891636
          ],
          [
            100.03998976781634,
            17.978898168255824
          ],
          [
            100.040601145786,
            17.978956903280647
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1434549303",
        "name_th": "ทางหลวงหมายเลข 1419",
        "name_en": "1419",
        "ref": "1419",
        "category": "main_road",
        "highway_type": "secondary",
        "surface": "paved",
        "lanes": 2,
        "length_km": 0.6
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.050452,
            17.97855
          ],
          [
            100.050311,
            17.978798
          ],
          [
            100.050246,
            17.978961
          ],
          [
            100.050202,
            17.979112
          ],
          [
            100.05009,
            17.979998
          ],
          [
            100.05,
            17.98043
          ],
          [
            100.049846,
            17.98108
          ]
        ]
      },
      "properties": {
        "id": "road-108307755",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.059595,
            17.982912
          ],
          [
            100.059514,
            17.982661
          ],
          [
            100.059498,
            17.982527
          ],
          [
            100.059472,
            17.982096
          ]
        ]
      },
      "properties": {
        "id": "road-108307761",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.059454,
            17.981535
          ],
          [
            100.059402,
            17.979306
          ],
          [
            100.059369,
            17.979212
          ],
          [
            100.059316,
            17.979122
          ],
          [
            100.058852,
            17.978484
          ],
          [
            100.058654,
            17.978192
          ],
          [
            100.057963,
            17.977168
          ]
        ]
      },
      "properties": {
        "id": "road-108309281",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.053533,
            17.982441
          ],
          [
            100.053659,
            17.982512
          ],
          [
            100.053763,
            17.982532
          ],
          [
            100.055083,
            17.982267
          ],
          [
            100.055241,
            17.982262
          ],
          [
            100.05531,
            17.982623
          ],
          [
            100.055363,
            17.982824
          ],
          [
            100.055415,
            17.983083
          ],
          [
            100.055371,
            17.983129
          ],
          [
            100.055324,
            17.98318
          ],
          [
            100.055104,
            17.9832
          ]
        ]
      },
      "properties": {
        "id": "road-108309285",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.059472,
            17.982096
          ],
          [
            100.059454,
            17.981535
          ]
        ]
      },
      "properties": {
        "id": "road-108309286",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.045372,
            17.984836
          ],
          [
            100.045119,
            17.98426
          ],
          [
            100.044988,
            17.983921
          ],
          [
            100.04498,
            17.983853
          ],
          [
            100.045291,
            17.983817
          ],
          [
            100.045882,
            17.983776
          ]
        ]
      },
      "properties": {
        "id": "road-108546633",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.06489,
            17.997825
          ],
          [
            100.064679,
            17.997568
          ],
          [
            100.064418,
            17.997326
          ],
          [
            100.064072,
            17.996915
          ],
          [
            100.064005,
            17.996701
          ],
          [
            100.063873,
            17.996433
          ],
          [
            100.063863,
            17.996323
          ],
          [
            100.063876,
            17.995627
          ],
          [
            100.06386,
            17.995402
          ],
          [
            100.063511,
            17.994851
          ],
          [
            100.063299,
            17.994326
          ],
          [
            100.063218,
            17.993961
          ],
          [
            100.063122,
            17.993244
          ],
          [
            100.063085,
            17.993137
          ],
          [
            100.062999,
            17.993043
          ],
          [
            100.061644,
            17.992148
          ],
          [
            100.061524,
            17.992081
          ],
          [
            100.060245,
            17.991289
          ],
          [
            100.06012,
            17.991178
          ],
          [
            100.060038,
            17.99108
          ],
          [
            100.059984,
            17.990969
          ],
          [
            100.059895,
            17.990637
          ],
          [
            100.059824,
            17.99052
          ],
          [
            100.059646,
            17.99032
          ],
          [
            100.059513,
            17.990166
          ],
          [
            100.059404,
            17.989994
          ],
          [
            100.05921,
            17.989574
          ],
          [
            100.058754,
            17.988634
          ],
          [
            100.058708,
            17.988516
          ],
          [
            100.058632,
            17.988173
          ],
          [
            100.058453,
            17.987705
          ],
          [
            100.058285,
            17.987419
          ],
          [
            100.058105,
            17.986972
          ],
          [
            100.058014,
            17.986717
          ],
          [
            100.057867,
            17.986291
          ],
          [
            100.057827,
            17.986158
          ],
          [
            100.057687,
            17.985718
          ],
          [
            100.057298,
            17.984839
          ],
          [
            100.057068,
            17.984289
          ]
        ]
      },
      "properties": {
        "id": "road-108546634",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.042523,
            17.990198
          ],
          [
            100.042346,
            17.989734
          ],
          [
            100.042026,
            17.989143
          ],
          [
            100.041981,
            17.98906
          ],
          [
            100.042019,
            17.988861
          ],
          [
            100.04174,
            17.988586
          ],
          [
            100.041708,
            17.988468
          ],
          [
            100.041736,
            17.988407
          ],
          [
            100.041761,
            17.988351
          ],
          [
            100.042573,
            17.987548
          ],
          [
            100.043012,
            17.987208
          ],
          [
            100.043091,
            17.987155
          ],
          [
            100.043123,
            17.987079
          ],
          [
            100.042978,
            17.986778
          ],
          [
            100.042911,
            17.986629
          ],
          [
            100.042842,
            17.986344
          ],
          [
            100.042725,
            17.985819
          ],
          [
            100.043089,
            17.985589
          ],
          [
            100.043356,
            17.985405
          ],
          [
            100.043748,
            17.985137
          ],
          [
            100.045119,
            17.98426
          ],
          [
            100.045882,
            17.983776
          ],
          [
            100.046433,
            17.983703
          ],
          [
            100.047655,
            17.983585
          ],
          [
            100.04808,
            17.983539
          ]
        ]
      },
      "properties": {
        "id": "road-108546635",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.036928,
            17.985269
          ],
          [
            100.036429,
            17.985381
          ],
          [
            100.035973,
            17.985336
          ],
          [
            100.035609,
            17.985351
          ],
          [
            100.035328,
            17.985345
          ]
        ]
      },
      "properties": {
        "id": "road-108546968",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.035328,
            17.985345
          ],
          [
            100.035084,
            17.985112
          ],
          [
            100.034836,
            17.98474
          ]
        ]
      },
      "properties": {
        "id": "road-108546969",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.045575,
            17.981379
          ],
          [
            100.04539,
            17.98151
          ],
          [
            100.045181,
            17.98165
          ],
          [
            100.044878,
            17.981885
          ],
          [
            100.044688,
            17.982005
          ],
          [
            100.044562,
            17.98206
          ],
          [
            100.044369,
            17.982124
          ],
          [
            100.043663,
            17.982416
          ],
          [
            100.04329,
            17.982539
          ]
        ]
      },
      "properties": {
        "id": "road-108546972",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.033429,
            17.988961
          ],
          [
            100.033793,
            17.988833
          ],
          [
            100.034031,
            17.988726
          ],
          [
            100.034217,
            17.988706
          ],
          [
            100.034563,
            17.988749
          ],
          [
            100.034874,
            17.98879
          ],
          [
            100.035498,
            17.988858
          ],
          [
            100.035523,
            17.988861
          ],
          [
            100.035914,
            17.988882
          ],
          [
            100.036172,
            17.9888
          ],
          [
            100.036311,
            17.988632
          ],
          [
            100.036408,
            17.988371
          ]
        ]
      },
      "properties": {
        "id": "road-108546975",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.055818,
            17.986885
          ],
          [
            100.056866,
            17.986798
          ],
          [
            100.05736,
            17.986774
          ],
          [
            100.058014,
            17.986717
          ]
        ]
      },
      "properties": {
        "id": "road-108549980",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.056787,
            17.986371
          ],
          [
            100.05667,
            17.985785
          ],
          [
            100.056594,
            17.985441
          ],
          [
            100.056341,
            17.984487
          ]
        ]
      },
      "properties": {
        "id": "road-108549982",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.056143,
            17.985835
          ],
          [
            100.05667,
            17.985785
          ],
          [
            100.056861,
            17.985772
          ],
          [
            100.057687,
            17.985718
          ]
        ]
      },
      "properties": {
        "id": "road-108549983",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "paved",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.05575,
            17.986224
          ],
          [
            100.055415,
            17.986253
          ],
          [
            100.055374,
            17.986229
          ],
          [
            100.055279,
            17.986076
          ],
          [
            100.055128,
            17.985861
          ],
          [
            100.055038,
            17.985756
          ],
          [
            100.054969,
            17.985682
          ],
          [
            100.054722,
            17.985449
          ],
          [
            100.054676,
            17.985394
          ],
          [
            100.054581,
            17.985151
          ],
          [
            100.054514,
            17.98501
          ],
          [
            100.054422,
            17.984895
          ]
        ]
      },
      "properties": {
        "id": "road-108549984",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.057867,
            17.986291
          ],
          [
            100.057312,
            17.986341
          ],
          [
            100.056787,
            17.986371
          ],
          [
            100.055775,
            17.986465
          ]
        ]
      },
      "properties": {
        "id": "road-108549986",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.063077,
            17.983641
          ],
          [
            100.062295,
            17.983998
          ],
          [
            100.062122,
            17.984086
          ],
          [
            100.061758,
            17.98431
          ],
          [
            100.06155,
            17.984472
          ],
          [
            100.06138,
            17.98461
          ],
          [
            100.061047,
            17.984834
          ],
          [
            100.060661,
            17.984933
          ],
          [
            100.06019,
            17.98512
          ],
          [
            100.06011,
            17.98513
          ],
          [
            100.059729,
            17.985179
          ],
          [
            100.05958,
            17.985244
          ],
          [
            100.059438,
            17.985308
          ],
          [
            100.059246,
            17.98541
          ],
          [
            100.058919,
            17.985652
          ],
          [
            100.05874,
            17.985725
          ],
          [
            100.058223,
            17.985948
          ],
          [
            100.057827,
            17.986158
          ]
        ]
      },
      "properties": {
        "id": "road-108549987",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.060305,
            17.983981
          ],
          [
            100.060123,
            17.984
          ],
          [
            100.059958,
            17.983973
          ],
          [
            100.059895,
            17.983978
          ],
          [
            100.059592,
            17.984008
          ]
        ]
      },
      "properties": {
        "id": "road-108550779",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.055406,
            17.987484
          ],
          [
            100.055471,
            17.98741
          ],
          [
            100.055649,
            17.987122
          ],
          [
            100.055818,
            17.986885
          ],
          [
            100.055775,
            17.986465
          ],
          [
            100.05575,
            17.986224
          ],
          [
            100.055705,
            17.985812
          ]
        ]
      },
      "properties": {
        "id": "road-108550782",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.059562,
            17.983044
          ],
          [
            100.059671,
            17.983441
          ],
          [
            100.059606,
            17.983442
          ],
          [
            100.059498,
            17.98346
          ],
          [
            100.059467,
            17.98348
          ],
          [
            100.059509,
            17.983749
          ],
          [
            100.059592,
            17.984008
          ],
          [
            100.059571,
            17.984086
          ],
          [
            100.059651,
            17.984438
          ],
          [
            100.059637,
            17.984469
          ],
          [
            100.059522,
            17.98454
          ],
          [
            100.059509,
            17.984573
          ],
          [
            100.05965,
            17.984815
          ],
          [
            100.059729,
            17.985179
          ]
        ]
      },
      "properties": {
        "id": "road-108550783",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.06065,
            17.983303
          ],
          [
            100.060702,
            17.983325
          ],
          [
            100.061383,
            17.982918
          ],
          [
            100.06179,
            17.98265
          ],
          [
            100.062207,
            17.982381
          ],
          [
            100.062183,
            17.982336
          ],
          [
            100.06202,
            17.982124
          ],
          [
            100.06183,
            17.981869
          ]
        ]
      },
      "properties": {
        "id": "road-108550784",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.062559,
            17.985441
          ],
          [
            100.062454,
            17.985215
          ],
          [
            100.062431,
            17.985133
          ],
          [
            100.06243,
            17.985071
          ],
          [
            100.062468,
            17.984985
          ],
          [
            100.062499,
            17.984917
          ],
          [
            100.062524,
            17.984856
          ],
          [
            100.062502,
            17.984791
          ],
          [
            100.062327,
            17.984519
          ],
          [
            100.062122,
            17.984086
          ],
          [
            100.06211,
            17.983966
          ],
          [
            100.061993,
            17.983722
          ],
          [
            100.061792,
            17.983447
          ]
        ]
      },
      "properties": {
        "id": "road-108550785",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.06065,
            17.983303
          ],
          [
            100.060517,
            17.983325
          ],
          [
            100.060189,
            17.98342
          ],
          [
            100.059746,
            17.983442
          ],
          [
            100.059671,
            17.983441
          ]
        ]
      },
      "properties": {
        "id": "road-108550786",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.061143,
            17.983699
          ],
          [
            100.06155,
            17.984472
          ]
        ]
      },
      "properties": {
        "id": "road-108550787",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.060189,
            17.98342
          ],
          [
            100.060241,
            17.983619
          ],
          [
            100.060305,
            17.983981
          ],
          [
            100.06033,
            17.984002
          ],
          [
            100.060386,
            17.984091
          ],
          [
            100.060426,
            17.984109
          ],
          [
            100.060463,
            17.984109
          ],
          [
            100.060504,
            17.984096
          ],
          [
            100.060808,
            17.983885
          ],
          [
            100.060885,
            17.983824
          ],
          [
            100.061143,
            17.983699
          ],
          [
            100.061584,
            17.983597
          ],
          [
            100.061656,
            17.983571
          ],
          [
            100.061737,
            17.983498
          ],
          [
            100.061792,
            17.983447
          ],
          [
            100.061879,
            17.98337
          ],
          [
            100.061943,
            17.983329
          ],
          [
            100.062025,
            17.983307
          ],
          [
            100.062113,
            17.983299
          ],
          [
            100.062218,
            17.983312
          ],
          [
            100.062298,
            17.983337
          ],
          [
            100.062523,
            17.983437
          ],
          [
            100.062877,
            17.983548
          ],
          [
            100.062979,
            17.983587
          ],
          [
            100.063077,
            17.983641
          ],
          [
            100.063213,
            17.983706
          ],
          [
            100.063308,
            17.983801
          ],
          [
            100.063386,
            17.983896
          ],
          [
            100.063475,
            17.983967
          ],
          [
            100.063573,
            17.984072
          ],
          [
            100.063785,
            17.984422
          ],
          [
            100.063829,
            17.984454
          ],
          [
            100.064168,
            17.984483
          ],
          [
            100.064259,
            17.984505
          ],
          [
            100.064322,
            17.984531
          ],
          [
            100.064527,
            17.984741
          ],
          [
            100.064694,
            17.985013
          ],
          [
            100.064711,
            17.985062
          ],
          [
            100.064671,
            17.985101
          ],
          [
            100.064424,
            17.985182
          ],
          [
            100.064173,
            17.985257
          ],
          [
            100.06382,
            17.9853
          ],
          [
            100.063461,
            17.985333
          ],
          [
            100.063277,
            17.985343
          ],
          [
            100.062925,
            17.98539
          ],
          [
            100.062733,
            17.98543
          ],
          [
            100.062559,
            17.985441
          ],
          [
            100.062433,
            17.985484
          ],
          [
            100.062185,
            17.985542
          ],
          [
            100.062099,
            17.985598
          ],
          [
            100.062017,
            17.985667
          ],
          [
            100.061751,
            17.986004
          ],
          [
            100.061681,
            17.986061
          ],
          [
            100.061603,
            17.986112
          ],
          [
            100.06139,
            17.986196
          ]
        ]
      },
      "properties": {
        "id": "road-108550789",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.058105,
            17.986972
          ],
          [
            100.059369,
            17.986568
          ],
          [
            100.059708,
            17.987404
          ],
          [
            100.059897,
            17.987962
          ],
          [
            100.059949,
            17.988134
          ],
          [
            100.058754,
            17.988634
          ]
        ]
      },
      "properties": {
        "id": "road-108724191",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.064437,
            17.989438
          ],
          [
            100.064265,
            17.989152
          ],
          [
            100.064136,
            17.98879
          ],
          [
            100.063876,
            17.988436
          ],
          [
            100.063825,
            17.988366
          ],
          [
            100.063574,
            17.98811
          ],
          [
            100.06316,
            17.987688
          ],
          [
            100.062817,
            17.987361
          ],
          [
            100.062774,
            17.987321
          ],
          [
            100.062391,
            17.986989
          ],
          [
            100.061743,
            17.986487
          ],
          [
            100.06139,
            17.986196
          ],
          [
            100.0606,
            17.985547
          ],
          [
            100.06011,
            17.98513
          ]
        ]
      },
      "properties": {
        "id": "road-108724196",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.062897,
            17.989395
          ],
          [
            100.062272,
            17.989053
          ],
          [
            100.061848,
            17.988848
          ],
          [
            100.06144,
            17.988614
          ],
          [
            100.061348,
            17.988571
          ],
          [
            100.061277,
            17.988605
          ],
          [
            100.061228,
            17.988691
          ],
          [
            100.061137,
            17.988778
          ],
          [
            100.060607,
            17.988996
          ],
          [
            100.05921,
            17.989574
          ]
        ]
      },
      "properties": {
        "id": "road-108724198",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.059708,
            17.987404
          ],
          [
            100.060424,
            17.987157
          ],
          [
            100.060387,
            17.987004
          ],
          [
            100.060521,
            17.986954
          ],
          [
            100.061372,
            17.986638
          ],
          [
            100.061513,
            17.986586
          ],
          [
            100.061592,
            17.98658
          ]
        ]
      },
      "properties": {
        "id": "road-108724201",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.062433,
            17.985484
          ],
          [
            100.062505,
            17.985671
          ],
          [
            100.062606,
            17.985821
          ],
          [
            100.062642,
            17.985902
          ],
          [
            100.062668,
            17.986002
          ],
          [
            100.062678,
            17.986117
          ],
          [
            100.062633,
            17.986486
          ],
          [
            100.062641,
            17.986556
          ],
          [
            100.062682,
            17.986664
          ],
          [
            100.062857,
            17.987051
          ],
          [
            100.062928,
            17.987155
          ],
          [
            100.063024,
            17.987273
          ],
          [
            100.063356,
            17.987604
          ]
        ]
      },
      "properties": {
        "id": "road-108726518",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.063135,
            17.973361
          ],
          [
            100.063106,
            17.973187
          ],
          [
            100.063103,
            17.973122
          ],
          [
            100.063175,
            17.972823
          ],
          [
            100.063183,
            17.972725
          ],
          [
            100.063167,
            17.972656
          ],
          [
            100.063122,
            17.97256
          ],
          [
            100.063071,
            17.972498
          ],
          [
            100.06288,
            17.972309
          ],
          [
            100.062677,
            17.972142
          ],
          [
            100.062372,
            17.971778
          ],
          [
            100.062034,
            17.971296
          ],
          [
            100.061957,
            17.97108
          ],
          [
            100.061872,
            17.970798
          ],
          [
            100.061876,
            17.970744
          ],
          [
            100.061899,
            17.970709
          ],
          [
            100.062234,
            17.970489
          ],
          [
            100.062485,
            17.970302
          ],
          [
            100.062657,
            17.970129
          ],
          [
            100.062659,
            17.970046
          ],
          [
            100.062587,
            17.969703
          ],
          [
            100.062569,
            17.969526
          ],
          [
            100.062543,
            17.969421
          ],
          [
            100.062508,
            17.969329
          ],
          [
            100.062459,
            17.969245
          ],
          [
            100.062384,
            17.969146
          ],
          [
            100.06223,
            17.968992
          ],
          [
            100.06205,
            17.968814
          ],
          [
            100.062002,
            17.968696
          ],
          [
            100.061943,
            17.968355
          ],
          [
            100.061894,
            17.968237
          ],
          [
            100.061776,
            17.968166
          ],
          [
            100.061381,
            17.96803
          ],
          [
            100.061092,
            17.967904
          ],
          [
            100.06092,
            17.967818
          ]
        ]
      },
      "properties": {
        "id": "road-108749887",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.063122,
            17.97256
          ],
          [
            100.063212,
            17.972407
          ],
          [
            100.063277,
            17.972337
          ],
          [
            100.063528,
            17.972162
          ],
          [
            100.06358,
            17.972102
          ],
          [
            100.063595,
            17.972085
          ],
          [
            100.063766,
            17.971955
          ],
          [
            100.06418,
            17.971651
          ],
          [
            100.064224,
            17.971586
          ],
          [
            100.0642,
            17.971537
          ],
          [
            100.063915,
            17.971274
          ],
          [
            100.063664,
            17.970976
          ],
          [
            100.063588,
            17.970876
          ],
          [
            100.063494,
            17.970772
          ],
          [
            100.063348,
            17.970623
          ],
          [
            100.063316,
            17.970613
          ],
          [
            100.063179,
            17.97058
          ],
          [
            100.063003,
            17.970465
          ],
          [
            100.062896,
            17.970377
          ],
          [
            100.062657,
            17.970129
          ]
        ]
      },
      "properties": {
        "id": "road-108749895",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.038151,
            17.988014
          ],
          [
            100.038291,
            17.988366
          ],
          [
            100.038419,
            17.988718
          ],
          [
            100.038489,
            17.988818
          ],
          [
            100.038602,
            17.988979
          ],
          [
            100.038757,
            17.989152
          ],
          [
            100.03895,
            17.98928
          ],
          [
            100.03902,
            17.989356
          ],
          [
            100.039052,
            17.989601
          ],
          [
            100.039111,
            17.989825
          ],
          [
            100.039224,
            17.99006
          ],
          [
            100.039417,
            17.990509
          ],
          [
            100.039423,
            17.990621
          ],
          [
            100.039283,
            17.991035
          ],
          [
            100.039138,
            17.991315
          ],
          [
            100.038988,
            17.991499
          ],
          [
            100.038983,
            17.99155
          ],
          [
            100.039079,
            17.991688
          ],
          [
            100.039245,
            17.991923
          ],
          [
            100.039361,
            17.992136
          ]
        ]
      },
      "properties": {
        "id": "road-108754389",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.049431,
            17.98411
          ],
          [
            100.04915,
            17.983423
          ]
        ]
      },
      "properties": {
        "id": "road-108754393",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.047532,
            17.984877
          ],
          [
            100.047139,
            17.984251
          ]
        ]
      },
      "properties": {
        "id": "road-108754394",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.036728,
            17.993758
          ],
          [
            100.037374,
            17.993376
          ],
          [
            100.03747,
            17.993106
          ]
        ]
      },
      "properties": {
        "id": "road-108754395",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.036923,
            17.989009
          ],
          [
            100.036918,
            17.988586
          ],
          [
            100.037139,
            17.988198
          ],
          [
            100.037679,
            17.988142
          ],
          [
            100.038151,
            17.988014
          ],
          [
            100.038287,
            17.987965
          ],
          [
            100.0388,
            17.98778
          ],
          [
            100.039058,
            17.987627
          ],
          [
            100.039428,
            17.987295
          ],
          [
            100.039701,
            17.987081
          ],
          [
            100.040065,
            17.986909
          ],
          [
            100.040398,
            17.986751
          ],
          [
            100.040511,
            17.986698
          ],
          [
            100.041718,
            17.986121
          ]
        ]
      },
      "properties": {
        "id": "road-108754398",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.041426,
            17.986785
          ],
          [
            100.040801,
            17.987162
          ],
          [
            100.040723,
            17.987168
          ],
          [
            100.040619,
            17.987167
          ],
          [
            100.040511,
            17.98706
          ],
          [
            100.040398,
            17.986751
          ]
        ]
      },
      "properties": {
        "id": "road-108754405",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.056333,
            17.982005
          ],
          [
            100.056042,
            17.982982
          ],
          [
            100.055952,
            17.983281
          ],
          [
            100.055993,
            17.983313
          ],
          [
            100.056399,
            17.983555
          ],
          [
            100.057194,
            17.984201
          ]
        ]
      },
      "properties": {
        "id": "road-108754413",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.040801,
            17.987162
          ],
          [
            100.041736,
            17.988407
          ]
        ]
      },
      "properties": {
        "id": "road-108754414",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.036202,
            17.992308
          ],
          [
            100.036585,
            17.992244
          ],
          [
            100.036676,
            17.992224
          ],
          [
            100.036976,
            17.992231
          ],
          [
            100.037025,
            17.992229
          ],
          [
            100.037095,
            17.992351
          ],
          [
            100.037213,
            17.9928
          ],
          [
            100.037119,
            17.99304
          ]
        ]
      },
      "properties": {
        "id": "road-108754415",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.05698,
            17.981942
          ],
          [
            100.05701,
            17.98216
          ],
          [
            100.057114,
            17.982815
          ],
          [
            100.057284,
            17.983357
          ]
        ]
      },
      "properties": {
        "id": "road-108754416",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.048921,
            17.98277
          ],
          [
            100.048915,
            17.982819
          ],
          [
            100.048946,
            17.983077
          ],
          [
            100.048958,
            17.98311
          ],
          [
            100.04915,
            17.983423
          ]
        ]
      },
      "properties": {
        "id": "road-108754418",
        "name_th": "ถนนสายเทศบาล",
        "name_en": "Municipal Road",
        "ref": "",
        "category": "local_road",
        "highway_type": "residential",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.044322,
            17.981094
          ],
          [
            100.044569,
            17.980967
          ],
          [
            100.044883,
            17.98083
          ],
          [
            100.045257,
            17.980702
          ],
          [
            100.047672,
            17.979874
          ],
          [
            100.048165,
            17.97978
          ]
        ]
      },
      "properties": {
        "id": "road-311061883",
        "name_th": "ทางรถไฟสายเหนือ",
        "name_en": "Northern Railway",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.043968,
            17.981232
          ],
          [
            100.044188,
            17.98114
          ],
          [
            100.044322,
            17.981094
          ],
          [
            100.048165,
            17.97978
          ],
          [
            100.049018,
            17.979547
          ]
        ]
      },
      "properties": {
        "id": "road-311061885",
        "name_th": "ทางรถไฟสายเหนือ",
        "name_en": "Northern Railway",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.048365,
            17.979779
          ],
          [
            100.048027,
            17.979953
          ],
          [
            100.047576,
            17.980203
          ],
          [
            100.047221,
            17.980341
          ],
          [
            100.044438,
            17.981318
          ],
          [
            100.044021,
            17.981414
          ],
          [
            100.043164,
            17.981613
          ]
        ]
      },
      "properties": {
        "id": "road-311061888",
        "name_th": "ทางรถไฟสายเหนือ",
        "name_en": "Northern Railway",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.044021,
            17.981414
          ],
          [
            100.047446,
            17.980207
          ],
          [
            100.048027,
            17.979953
          ]
        ]
      },
      "properties": {
        "id": "road-951416627",
        "name_th": "ทางรถไฟสายเหนือ",
        "name_en": "Northern Railway",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.045257,
            17.980702
          ],
          [
            100.045424,
            17.980592
          ],
          [
            100.045605,
            17.980472
          ],
          [
            100.04593,
            17.980219
          ],
          [
            100.046257,
            17.98001
          ],
          [
            100.046589,
            17.979847
          ],
          [
            100.047633,
            17.979473
          ]
        ]
      },
      "properties": {
        "id": "road-951416629",
        "name_th": "ทางรถไฟสายเหนือ",
        "name_en": "Northern Railway",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.046589,
            17.979847
          ],
          [
            100.044504,
            17.980574
          ]
        ]
      },
      "properties": {
        "id": "road-951416630",
        "name_th": "ทางรถไฟสายเหนือ",
        "name_en": "Northern Railway",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.045424,
            17.980592
          ],
          [
            100.045906,
            17.98037
          ],
          [
            100.048239,
            17.979557
          ]
        ]
      },
      "properties": {
        "id": "road-951416631",
        "name_th": "ทางรถไฟสายเหนือ",
        "name_en": "Northern Railway",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.047903,
            17.97959
          ],
          [
            100.046547,
            17.980058
          ],
          [
            100.045906,
            17.98037
          ]
        ]
      },
      "properties": {
        "id": "road-951416632",
        "name_th": "ทางรถไฟสายเหนือ",
        "name_en": "Northern Railway",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.04048335205545,
            18.00374547491276
          ],
          [
            100.03993408698771,
            18.002767696813834
          ],
          [
            100.03937030909066,
            18.001647559492326
          ],
          [
            100.03839278211386,
            17.999672277378608
          ],
          [
            100.03769729190253,
            17.998270705750432
          ],
          [
            100.03728774995156,
            17.9974325573518
          ],
          [
            100.037146,
            17.99712
          ],
          [
            100.037008,
            17.996784
          ],
          [
            100.03680735041164,
            17.99625796124554
          ],
          [
            100.036577,
            17.995576
          ],
          [
            100.036397,
            17.994913
          ],
          [
            100.036253,
            17.994261
          ],
          [
            100.036133,
            17.993603
          ],
          [
            100.036064,
            17.993089
          ],
          [
            100.035958,
            17.991585
          ],
          [
            100.035895,
            17.990864
          ],
          [
            100.035871,
            17.990428
          ],
          [
            100.035874,
            17.990147
          ],
          [
            100.03588,
            17.989734
          ],
          [
            100.035895,
            17.989492
          ],
          [
            100.035918,
            17.989249
          ],
          [
            100.03596,
            17.988953
          ],
          [
            100.036007,
            17.988649
          ],
          [
            100.036094,
            17.988243
          ],
          [
            100.036171,
            17.987944
          ],
          [
            100.03632,
            17.987441
          ],
          [
            100.036379,
            17.987276
          ],
          [
            100.036449,
            17.987089
          ],
          [
            100.036579,
            17.986792
          ],
          [
            100.036689,
            17.986546
          ],
          [
            100.0368,
            17.986346
          ],
          [
            100.036894,
            17.986154
          ],
          [
            100.036999,
            17.985971
          ],
          [
            100.037096,
            17.985801
          ],
          [
            100.037302,
            17.985468
          ],
          [
            100.037472,
            17.985239
          ],
          [
            100.03762,
            17.985026
          ],
          [
            100.03791,
            17.984675
          ],
          [
            100.038095,
            17.984472
          ],
          [
            100.03829,
            17.984263
          ],
          [
            100.038424,
            17.984126
          ],
          [
            100.038545,
            17.98401
          ],
          [
            100.03873,
            17.983835
          ],
          [
            100.039138,
            17.983506
          ],
          [
            100.039394,
            17.983313
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1551536186",
        "name_th": "ทางรถไฟสายเด่นชัย–เชียงราย–เชียงของ",
        "name_en": "Den Chai–Chiang Khong Line",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2,
        "length_km": 2.486
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.039461,
            17.98332
          ],
          [
            100.038745,
            17.983883
          ],
          [
            100.038609,
            17.984009
          ],
          [
            100.038498,
            17.984119
          ],
          [
            100.038358,
            17.984256
          ],
          [
            100.038212,
            17.98441
          ],
          [
            100.038093,
            17.984544
          ],
          [
            100.037954,
            17.984705
          ],
          [
            100.037826,
            17.984857
          ],
          [
            100.037672,
            17.985046
          ],
          [
            100.037567,
            17.985183
          ],
          [
            100.037411,
            17.985396
          ],
          [
            100.037305,
            17.985551
          ],
          [
            100.037097,
            17.98588
          ],
          [
            100.036943,
            17.986155
          ],
          [
            100.036809,
            17.986414
          ],
          [
            100.036654,
            17.986733
          ],
          [
            100.036539,
            17.986988
          ],
          [
            100.036442,
            17.98721
          ],
          [
            100.036384,
            17.987406
          ],
          [
            100.036273,
            17.987744
          ],
          [
            100.036175,
            17.988075
          ],
          [
            100.036122,
            17.988345
          ],
          [
            100.036047,
            17.988715
          ],
          [
            100.036,
            17.988986
          ],
          [
            100.035946,
            17.989317
          ],
          [
            100.035929,
            17.989588
          ],
          [
            100.035922,
            17.989905
          ],
          [
            100.035917,
            17.990329
          ],
          [
            100.035911,
            17.99045
          ],
          [
            100.035929,
            17.990794
          ],
          [
            100.035968,
            17.991263
          ],
          [
            100.035997,
            17.99159
          ],
          [
            100.036137,
            17.993253
          ],
          [
            100.036188,
            17.993627
          ],
          [
            100.036246,
            17.993956
          ],
          [
            100.03641,
            17.994773
          ],
          [
            100.036629,
            17.995594
          ],
          [
            100.036777,
            17.996038
          ],
          [
            100.03694,
            17.996476
          ],
          [
            100.037128,
            17.996964
          ],
          [
            100.03740649601983,
            17.997578513080192
          ],
          [
            100.03767195170995,
            17.998114305643643
          ],
          [
            100.03807763974834,
            17.998911746567227
          ],
          [
            100.03883051694766,
            18.000396882539537
          ],
          [
            100.03945224629507,
            18.00163571271752
          ],
          [
            100.04054771863201,
            18.00370569943652
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1551536187",
        "name_th": "ทางรถไฟสายเด่นชัย–เชียงราย–เชียงของ",
        "name_en": "Den Chai–Chiang Khong Line",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2,
        "length_km": 2.483
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.042944,
            17.981792
          ],
          [
            100.041066,
            17.982453
          ],
          [
            100.040672,
            17.982601
          ],
          [
            100.040425,
            17.982723
          ],
          [
            100.040194,
            17.98285
          ],
          [
            100.039461,
            17.98332
          ]
        ]
      },
      "properties": {
        "id": "road-1551536189",
        "name_th": "ทางรถไฟสายเด่นชัย–เชียงราย–เชียงของ",
        "name_en": "Den Chai–Chiang Khong Line",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "LineString",
        "coordinates": [
          [
            100.039394,
            17.983313
          ],
          [
            100.039505,
            17.983229
          ],
          [
            100.04016,
            17.982808
          ],
          [
            100.040621,
            17.98257
          ],
          [
            100.041229,
            17.98234
          ],
          [
            100.042916,
            17.981741
          ]
        ]
      },
      "properties": {
        "id": "road-1551536190",
        "name_th": "ทางรถไฟสายเด่นชัย–เชียงราย–เชียงของ",
        "name_en": "Den Chai–Chiang Khong Line",
        "ref": "",
        "category": "rail",
        "highway_type": "rail",
        "surface": "asphalt",
        "lanes": 2
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "Point",
        "coordinates": [
          100.05152,
          17.98055
        ]
      },
      "properties": {
        "id": "infra-br-1",
        "name_th": "สะพานข้ามลำน้ำแม่สอง (เทศบาล)",
        "name_en": "Mae Song River Municipal Bridge",
        "category": "bridge",
        "description_th": "สะพานคอนกรีตเสริมเหล็กข้ามลำน้ำแม่สอง เชื่อมชุมชนย่านเศรษฐกิจ",
        "width_m": 10
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "Point",
        "coordinates": [
          100.0465,
          17.9782
        ]
      },
      "properties": {
        "id": "infra-br-2",
        "name_th": "สะพานรถไฟข้ามลำน้ำแม่สอง",
        "name_en": "Railway Bridge Mae Song",
        "category": "bridge",
        "description_th": "สะพานโครงเหล็กสำหรับทางรถไฟสายเหนือ",
        "width_m": 6
      }
    },
    {
      "type": "Feature",
      "id": "infra-br-3",
      "geometry": {
        "type": "Point",
        "coordinates": [
          100.05948,
          17.981792
        ]
      },
      "properties": {
        "id": "infra-br-3",
        "name_th": "สะพานคลองส่งน้ำชลประทาน",
        "name_en": "Irrigation Canal Bridge",
        "category": "bridge",
        "description_th": "สะพานข้ามคลองส่งน้ำชลประทานเด่นชัย",
        "width_m": 7,
        "description_en": "",
        "surface_type": "concrete",
        "condition": "good",
        "right_of_way_m": 8,
        "lanes": 2,
        "drainage": "none",
        "lighting": "none",
        "plan_status": "completed",
        "fiscal_year": "2567"
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "Point",
        "coordinates": [
          100.04652,
          17.98512
        ]
      },
      "properties": {
        "id": "infra-wt-1",
        "name_th": "โรงผลิตน้ำประปาเทศบาลตำบลเด่นชัย",
        "name_en": "Den Chai Municipal Water Treatment Plant",
        "category": "water",
        "description_th": "โรงกรองน้ำและผลิตน้ำประปาผิวดินบริการประชาชน กำลังผลิต 250 ลบ.ม./ชม.",
        "capacity_m3": 250
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "Point",
        "coordinates": [
          100.0592,
          17.9812
        ]
      },
      "properties": {
        "id": "infra-wt-2",
        "name_th": "หอถังพักจ่ายน้ำประปาแรงดันสูง",
        "name_en": "Municipal Elevated Water Storage Tower",
        "category": "water",
        "description_th": "หอถังสูงคอนกรีตสำรองน้ำและจ่ายแรงดันน้ำ",
        "capacity_m3": 150
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "type": "Point",
        "coordinates": [
          100.04758,
          17.98315
        ]
      },
      "properties": {
        "id": "infra-el-1",
        "name_th": "สถานีไฟฟ้าย่อยเด่นชัย (กฟภ.)",
        "name_en": "PEA Den Chai Substation",
        "category": "electric",
        "description_th": "สถานีไฟฟ้าแรงสูง 115/22 kV การไฟฟ้าส่วนภูมิภาค",
        "capacity_kva": 25000
      }
    },
    {
      "type": "Feature",
      "id": "infra-el-2",
      "geometry": {
        "type": "Point",
        "coordinates": [
          100.051959,
          17.982736
        ]
      },
      "properties": {
        "id": "infra-el-2",
        "name_th": "หม้อแปลงไฟฟ้าศูนย์กลางชุมชนเด่นชัย",
        "name_en": "Downtown Community Transformer 500kVA",
        "category": "electric",
        "description_th": "หม้อแปลงไฟฟ้าจ่ายไฟย่านพาณิชยกรรมและศูนย์ราชการ",
        "capacity_kva": 500,
        "description_en": "",
        "surface_type": "concrete",
        "condition": "good",
        "width_m": 6,
        "right_of_way_m": 8,
        "lanes": 2,
        "drainage": "none",
        "lighting": "none",
        "plan_status": "completed",
        "fiscal_year": "2567"
      }
    },
    {
      "type": "Feature",
      "geometry": {
        "coordinates": [
          [
            100.0543618843202,
            17.978907816191736
          ],
          [
            100.05454031272075,
            17.978746878742314
          ],
          [
            100.05462337421687,
            17.978659094616745
          ],
          [
            100.05474335193543,
            17.978568384307778
          ],
          [
            100.05490024587363,
            17.97847474781092
          ],
          [
            100.0550448344049,
            17.978404520405846
          ],
          [
            100.05521403375019,
            17.97835184983387
          ],
          [
            100.05541092025982,
            17.97833429297286
          ],
          [
            100.05560780677098,
            17.97833721911651
          ],
          [
            100.05573862641478,
            17.978341165759446
          ],
          [
            100.05584181021158,
            17.97833415535429
          ],
          [
            100.05595604941698,
            17.978295598121747
          ],
          [
            100.05610713997737,
            17.978236009653713
          ],
          [
            100.0563374609535,
            17.978148379517904
          ],
          [
            100.05647933867556,
            17.97810456443409
          ],
          [
            100.0566369772543,
            17.97802883073524
          ],
          [
            100.05674105041635,
            17.977973076733306
          ],
          [
            100.05687144093093,
            17.977888876778877
          ],
          [
            100.05701140138927,
            17.97778647137457
          ],
          [
            100.05781881868165,
            17.977185845007696
          ],
          [
            100.0579585931826,
            17.977082825896872
          ],
          [
            100.05843561705427,
            17.976721184293467
          ],
          [
            100.05877589630393,
            17.9764718240164
          ],
          [
            100.05896650615995,
            17.976332453514672
          ],
          [
            100.05907931607516,
            17.976248584486115
          ],
          [
            100.0592197736728,
            17.97613803892797
          ],
          [
            100.05930656012225,
            17.976055488928495
          ],
          [
            100.05938623292758,
            17.975974292169468
          ],
          [
            100.05949862849337,
            17.975876856010586
          ],
          [
            100.05962098315939,
            17.97575506073602
          ],
          [
            100.05971772871027,
            17.97567521712142
          ],
          [
            100.05995672403543,
            17.975471994663607
          ],
          [
            100.06009353825448,
            17.97537473499429
          ],
          [
            100.06032396220098,
            17.975208982477454
          ],
          [
            100.06053566420229,
            17.975063777665056
          ],
          [
            100.06109215057364,
            17.974661371313445
          ],
          [
            100.06171973676607,
            17.97422968798466
          ],
          [
            100.06247882892052,
            17.97369878915346
          ],
          [
            100.06278946691447,
            17.97347843230125
          ],
          [
            100.06311678048655,
            17.973289259096447
          ],
          [
            100.06350130044831,
            17.973127614238663
          ],
          [
            100.06385720920889,
            17.97299439179858
          ],
          [
            100.0640372279185,
            17.97294507635118
          ],
          [
            100.06437278279117,
            17.97289302114308
          ],
          [
            100.06455574927179,
            17.972876977647616
          ],
          [
            100.06470433901768,
            17.972873376654732
          ],
          [
            100.06484157158559,
            17.972871576158326
          ],
          [
            100.06489457174843,
            17.972868875413994
          ],
          [
            100.06497030103918,
            17.97285925581305
          ],
          [
            100.06503544642311,
            17.97284558673762
          ],
          [
            100.06513412251888,
            17.97280822459429
          ],
          [
            100.06519351977977,
            17.972776330075533
          ],
          [
            100.06524812693857,
            17.9727344115567
          ],
          [
            100.06531423034323,
            17.972658775942094
          ],
          [
            100.0653841658276,
            17.972560358467575
          ],
          [
            100.06546056909588,
            17.972443364464
          ],
          [
            100.06558506073986,
            17.9722530873471
          ],
          [
            100.06578961785374,
            17.97195182539612
          ],
          [
            100.06586154664683,
            17.97184019399974
          ],
          [
            100.06601393490644,
            17.971565497515968
          ],
          [
            100.06647593366984,
            17.97079115985504
          ],
          [
            100.06661699484494,
            17.97054661986398
          ],
          [
            100.06668193047045,
            17.970419745506234
          ],
          [
            100.06686445222942,
            17.970047468905847
          ],
          [
            100.0669381629404,
            17.96988052847132
          ],
          [
            100.06695294439248,
            17.96984106877494
          ]
        ],
        "type": "LineString"
      },
      "properties": {
        "id": "road-1787891972967",
        "name_th": "ซอย",
        "name_en": "ซอย",
        "category": "local_road",
        "description_th": "ถนนที่วาดใหม่ ความยาว 1.741 กม.",
        "length_km": 1.741,
        "description_en": ""
      }
    }
  ]
};
